// این دیکشنری برای تطبیق الگوها استفاده می‌شود
const dictionary = {
  // اعمال پایه
  "چاپ کن": "console.log",
  "تعریف کن": "let",
  "ثابت": "const",
  "متغیر": "let",
  "تابع": "function",
  "اگر": "if",
  "وگرنه": "else",
  "برای": "for",
  "تا": "<=",
  "از": "=",
  "برگردان": "return",
  "آرایه": "[]",
  "شیء": "{}",
  "اضافه کن": ".push",
  "حذف کن": ".pop",
  "طول": ".length",
  "ورود": "prompt",
  "هشدار": "alert",
  "عدد": "Number",
  "متن": "String",

  // عملگرها
  "بعلاوه": "+",
  "منهای": "-",
  "ضربدر": "*",
  "تقسیم": "/",
  "باقیمانده": "%",
  "مساوی": "===",
  "نامساوی": "!==",
  "بزرگتر": ">",
  "کوچکتر": "<",
  "و": "&&",
  "یا": "||",
  "نه": "!",

  // مقادیر
  "درست": "true",
  "نادرست": "false",
  "خالی": "null",
  "نامعین": "undefined"
};

export default dictionary;
